---
title: ElectricalPerPhaseData
classe: Autodesk.Revit.DB.Electrical.ElectricalPerPhaseData
namespace: Autodesk.Revit.DB.Electrical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# ElectricalPerPhaseData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double CurrentPhaseA { get; }` | `electricalPerPhaseData.CurrentPhaseA` | Double |
| `Double CurrentPhaseB { get; }` | `electricalPerPhaseData.CurrentPhaseB` | Double |
| `Double CurrentPhaseC { get; }` | `electricalPerPhaseData.CurrentPhaseC` | Double |
| `Boolean IsValidObject { get; }` | `electricalPerPhaseData.IsValidObject` | Boolean |
| `Void Dispose()` | `electricalPerPhaseData.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```